In [2]:
pip install Numpy

Requirement already satisfied: Numpy in c:\users\03\anaconda3\lib\site-packages (1.18.1)
Note: you may need to restart the kernel to use updated packages.

In [11]:
import numpy as np

In [13]:
b = [[1, 2, 3, 3, 1], [6, 8, 11, 10]]
a = np.array(b)

In [14]:
a

array([list([1, 2, 3, 3, 1]), list([6, 8, 11, 10])], dtype=object)

mean(a)

In [19]:
a = np.array([[1, 2, 3, 3, 1], [6, 8, 11, 10]])

In [22]:
a = np.array([1, 2, 3, 3, 1])

In [23]:
np.mean(a)

2.0

In [25]:
a = np.array([[1, 6], 
              [2, 8],
              [3, 11],
              [3, 10],
              [1, 7]])

In [26]:
a[0,0]

1

In [27]:
a[1,0]

2

In [28]:
mean_a = [np.mean([a[0, 1], a[1, 1], a[2,1], a[3, 1], a[4, 1]])], [np.mean([a[0, 0], a[1, 0], a[2,0], a[3, 0], a[4, 0]])]

In [29]:
mean_a

([8.4], [2.0])

In [30]:
mean_a = [np.mean([a[0, 1], a[1, 1], a[2,1], a[3, 1], a[4, 1]])], [np.mean([a[0, 0], a[1, 0], a[2,0], a[3, 0], a[4, 0]])]

In [31]:
mean_a

([8.4], [2.0])

In [34]:
mean_a = [np.mean([a[0, 0], a[1, 0], a[2,0], a[3, 0], a[4, 0]]), np.mean([a[0, 1], a[1, 1], a[2,1], a[3, 1], a[4, 1]])]

In [35]:
mean_a

[2.0, 8.4]

In [36]:
a_centered = a - mean_a

In [37]:
a_centered

array([[-1. , -2.4],
       [ 0. , -0.4],
       [ 1. ,  2.6],
       [ 1. ,  1.6],
       [-1. , -1.4]])

In [38]:
a_centered_sp = a_centered[0,0]*a_centered[1,0]*a_centered[2,0]*a_centered[3,0]*a_centered[4,0]+a_centered[0,1]*a_centered[1,1]*a_centered[2,1]*a_centered[3,1]*a_centered[4,1]

In [39]:
a_centered_sp

-5.591040000000005

In [42]:
a_centered_sp/((a[0, 1]+a[1, 1]+a[2,1]+a[3, 1]+a[4, 1])-1)

-0.1363668292682928

In [43]:
#Создание датафрейма задание 1 тема пандас

In [44]:
import pandas as pd

In [45]:
aut = {
    'author_id':[1, 2, 3],
    'author_name':['Тургенев', 'Чехов', 'Островский']
}
authors = pd.DataFrame(aut)

bk = {
    'author_id':[1, 1, 1, 2, 2, 3, 3],
    'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
    'price':[450, 300, 350, 500, 450, 370, 290]
}
book = pd.DataFrame(bk)

In [46]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

In [47]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [48]:
#Задание 2

In [50]:
author_price = pd.merge(authors, book, on = 'author_id', how = 'inner')

In [51]:
author_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [52]:
#Задание 3

In [53]:
top5 = author_price.nlargest(5,'price')

In [54]:
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

In [55]:
#Задание 4

In [62]:
max_price = author_price.groupby('author_name').agg({'price':'max'})

In [70]:
max_price.rename(columns = {'price':'max_price'})

             max_price
author_name
Островский         370
Тургенев           450
Чехов              500

In [63]:
min_price = author_price.groupby('author_name').agg({'price':'min'})

In [71]:
min_price.rename(columns = {'price':'min_price'})

             min_price
author_name
Островский         290
Тургенев           300
Чехов              450

In [64]:
mean_price = author_price.groupby('author_name').agg({'price':'mean'})

In [72]:
mean_price.rename(columns = {'price':'mean_price'})

             mean_price
author_name
Островский   330.000000
Тургенев     366.666667
Чехов        475.000000

In [85]:
authors_stat = pd.concat([max_price.rename(columns = {'price':'max_price'}), min_price.rename(columns = {'price':'min_price'}), mean_price.rename(columns = {'price':'mean_price'})], axis=1)

In [86]:
authors_stat

             max_price  min_price  mean_price
author_name
Островский         370        290  330.000000
Тургенев           450        300  366.666667
Чехов              500        450  475.000000